In [2]:
import sqlite3

In [4]:
db = sqlite3.connect('IMDB.sqlite')
db

In [6]:
db = sqlite3.connect('school.sqlite')
db

In [8]:
cur = db.cursor()
cur

In [9]:
sql_query = 'Create table Student (RollNumber int Primary key, Name Text, Age int)'
cur.execute(sql_query)

In [10]:
cur.execute('insert into Student values(11, "Ibrahim", 20)')

In [11]:
db.commit()

In [12]:
cur.execute('insert into Student values(12, "Muhammed", 22)')

In [13]:
db.commit()

In [14]:
db.close()

In [2]:
import sqlite3
db = sqlite3.connect('school.sqlite')
db

In [3]:
rollNumber = 16
Name = "Yasin"
Age = 22

In [6]:
cur = db.cursor()

In [8]:
cur.execute('Insert into Student values(?,?,?)', (rollNumber, Name, Age))

In [9]:
db.commit()

In [10]:
values = [
    (101, "Zayd", 27), (102, "Yusuf", 15), (103, "Amina", 22), (104, "Fatima", 19), (105, "Ali", 25),
    (106, "Hassan", 21), (107, "Khadija", 18), (108, "Omar", 24), (109, "Maryam", 20), (110, "Bilal", 23),
    (111, "Salma", 17), (112, "Ibrahim", 26), (113, "Sara", 22), (114, "Nuh", 16), (115, "Musa", 28),
    (116, "Ismail", 19), (117, "Sumayya", 20), (118, "Hamza", 25), (119, "Zainab", 21), (120, "Abdullah", 23),
    (121, "Yasin", 22), (122, "Rayyan", 18), (123, "Huda", 24), (124, "Tariq", 27), (125, "Lina", 20),
    (126, "Farah", 19), (127, "Jamal", 26), (128, "Nadia", 17), (129, "Rami", 22), (130, "Iman", 21),
    (131, "Samir", 23), (132, "Layla", 20), (133, "Zara", 18), (134, "Kamil", 25), (135, "Noor", 19),
    (136, "Adil", 24), (137, "Hana", 22), (138, "Faisal", 20), (139, "Lubna", 21), (140, "Taha", 23),
    (141, "Samiya", 26), (142, "Ayaan", 17), (143, "Rania", 19), (144, "Zubair", 22), (145, "Nabeel", 20),
    (146, "Asma", 18), (147, "Harun", 25), (148, "Mariam", 21), (149, "Sulaiman", 24), (150, "Nawal", 23)
]

In [11]:
cur.executemany('Insert into Student values(?,?,?)', values)

In [12]:
db.commit()

In [13]:
cur.execute('Update Student set RollNumber=100 where RollNumber=16')
db.commit()

In [14]:
new_age = 21
cur.execute('Update Student set Age=? where RollNumber=104', (new_age,))
db.commit()

In [15]:
 cur.execute("SELECT * FROM Student")
print(cur.fetchall())

[(11, 'Ibrahim', 20), (12, 'Muhammed', 22), (100, 'Yasin', 22), (101, 'Zayd', 27), (102, 'Yusuf', 15), (103, 'Amina', 22), (104, 'Fatima', 21), (105, 'Ali', 25), (106, 'Hassan', 21), (107, 'Khadija', 18), (108, 'Omar', 24), (109, 'Maryam', 20), (110, 'Bilal', 23), (111, 'Salma', 17), (112, 'Ibrahim', 26), (113, 'Sara', 22), (114, 'Nuh', 16), (115, 'Musa', 28), (116, 'Ismail', 19), (117, 'Sumayya', 20), (118, 'Hamza', 25), (119, 'Zainab', 21), (120, 'Abdullah', 23), (121, 'Yasin', 22), (122, 'Rayyan', 18), (123, 'Huda', 24), (124, 'Tariq', 27), (125, 'Lina', 20), (126, 'Farah', 19), (127, 'Jamal', 26), (128, 'Nadia', 17), (129, 'Rami', 22), (130, 'Iman', 21), (131, 'Samir', 23), (132, 'Layla', 20), (133, 'Zara', 18), (134, 'Kamil', 25), (135, 'Noor', 19), (136, 'Adil', 24), (137, 'Hana', 22), (138, 'Faisal', 20), (139, 'Lubna', 21), (140, 'Taha', 23), (141, 'Samiya', 26), (142, 'Ayaan', 17), (143, 'Rania', 19), (144, 'Zubair', 22), (145, 'Nabeel', 20), (146, 'Asma', 18), (147, 'Harun', 25), (148, 'Mariam', 21), (149, 'Sulaiman', 24), (150, 'Nawal', 23)]

In [16]:
cur.execute("SELECT Name, Age FROM Student")
print(cur.fetchall())

[('Ibrahim', 20), ('Muhammed', 22), ('Yasin', 22), ('Zayd', 27), ('Yusuf', 15), ('Amina', 22), ('Fatima', 21), ('Ali', 25), ('Hassan', 21), ('Khadija', 18), ('Omar', 24), ('Maryam', 20), ('Bilal', 23), ('Salma', 17), ('Ibrahim', 26), ('Sara', 22), ('Nuh', 16), ('Musa', 28), ('Ismail', 19), ('Sumayya', 20), ('Hamza', 25), ('Zainab', 21), ('Abdullah', 23), ('Yasin', 22), ('Rayyan', 18), ('Huda', 24), ('Tariq', 27), ('Lina', 20), ('Farah', 19), ('Jamal', 26), ('Nadia', 17), ('Rami', 22), ('Iman', 21), ('Samir', 23), ('Layla', 20), ('Zara', 18), ('Kamil', 25), ('Noor', 19), ('Adil', 24), ('Hana', 22), ('Faisal', 20), ('Lubna', 21), ('Taha', 23), ('Samiya', 26), ('Ayaan', 17), ('Rania', 19), ('Zubair', 22), ('Nabeel', 20), ('Asma', 18), ('Harun', 25), ('Mariam', 21), ('Sulaiman', 24), ('Nawal', 23)]

In [17]:
# Filtering
cur.execute("SELECT * FROM Student WHERE Age > 20")
print(cur.fetchall())

[(12, 'Muhammed', 22), (100, 'Yasin', 22), (101, 'Zayd', 27), (103, 'Amina', 22), (104, 'Fatima', 21), (105, 'Ali', 25), (106, 'Hassan', 21), (108, 'Omar', 24), (110, 'Bilal', 23), (112, 'Ibrahim', 26), (113, 'Sara', 22), (115, 'Musa', 28), (118, 'Hamza', 25), (119, 'Zainab', 21), (120, 'Abdullah', 23), (121, 'Yasin', 22), (123, 'Huda', 24), (124, 'Tariq', 27), (127, 'Jamal', 26), (129, 'Rami', 22), (130, 'Iman', 21), (131, 'Samir', 23), (134, 'Kamil', 25), (136, 'Adil', 24), (137, 'Hana', 22), (139, 'Lubna', 21), (140, 'Taha', 23), (141, 'Samiya', 26), (144, 'Zubair', 22), (147, 'Harun', 25), (148, 'Mariam', 21), (149, 'Sulaiman', 24), (150, 'Nawal', 23)]

In [18]:
# Sorting
cur.execute("SELECT * FROM Student ORDER BY Age DESC")
print(cur.fetchall())

[(115, 'Musa', 28), (101, 'Zayd', 27), (124, 'Tariq', 27), (112, 'Ibrahim', 26), (127, 'Jamal', 26), (141, 'Samiya', 26), (105, 'Ali', 25), (118, 'Hamza', 25), (134, 'Kamil', 25), (147, 'Harun', 25), (108, 'Omar', 24), (123, 'Huda', 24), (136, 'Adil', 24), (149, 'Sulaiman', 24), (110, 'Bilal', 23), (120, 'Abdullah', 23), (131, 'Samir', 23), (140, 'Taha', 23), (150, 'Nawal', 23), (12, 'Muhammed', 22), (100, 'Yasin', 22), (103, 'Amina', 22), (113, 'Sara', 22), (121, 'Yasin', 22), (129, 'Rami', 22), (137, 'Hana', 22), (144, 'Zubair', 22), (104, 'Fatima', 21), (106, 'Hassan', 21), (119, 'Zainab', 21), (130, 'Iman', 21), (139, 'Lubna', 21), (148, 'Mariam', 21), (11, 'Ibrahim', 20), (109, 'Maryam', 20), (117, 'Sumayya', 20), (125, 'Lina', 20), (132, 'Layla', 20), (138, 'Faisal', 20), (145, 'Nabeel', 20), (116, 'Ismail', 19), (126, 'Farah', 19), (135, 'Noor', 19), (143, 'Rania', 19), (107, 'Khadija', 18), (122, 'Rayyan', 18), (133, 'Zara', 18), (146, 'Asma', 18), (111, 'Salma', 17), (128, 'Nadia', 17), (142, 'Ayaan', 17), (114, 'Nuh', 16), (102, 'Yusuf', 15)]

In [19]:
# Insert one row
cur.execute("INSERT INTO Student VALUES (?, ?, ?)", (151, "Rehan", 22))
db.commit()

In [20]:
# Insert multiple rows
students = [
    (152, "Areeba", 20),
    (153, "Furqan", 23)
]
cur.executemany("INSERT INTO Student VALUES (?, ?, ?)", students)
db.commit()

In [21]:
# Update one student’s age
cur.execute("UPDATE Student SET Age = ? WHERE RollNumber = ?", (23, 151))
db.commit()

In [22]:
# Delete a student by RollNumber
cur.execute("DELETE FROM Student WHERE RollNumber = ?", (153,))
db.commit()

In [23]:
# Count total students
cur.execute("SELECT COUNT(*) FROM Student")
print(cur.fetchone())

# Average age
cur.execute("SELECT AVG(Age) FROM Student")
print(cur.fetchone())

# Oldest & youngest student
cur.execute("SELECT MAX(Age), MIN(Age) FROM Student")
print(cur.fetchone())

(55,)
(21.563636363636363,)
(28, 15)

In [24]:
print(cur.fetchone())

None

In [25]:
# Group students by age
cur.execute("SELECT Age, COUNT(*) FROM Student GROUP BY Age ORDER BY COUNT(*) DESC")
print(cur.fetchall())

[(22, 8), (20, 8), (23, 6), (21, 6), (25, 4), (24, 4), (19, 4), (18, 4), (26, 3), (17, 3), (27, 2), (28, 1), (16, 1), (15, 1)]

In [29]:
# Names starting with 'A'
cur.execute("SELECT * FROM Student WHERE Name LIKE 'M%'")
print(cur.fetchall())

# Names ending with 'a'
cur.execute("SELECT * FROM Student WHERE Name LIKE '%i'")
print(cur.fetchall())

[(12, 'Muhammed', 22), (109, 'Maryam', 20), (115, 'Musa', 28), (148, 'Mariam', 21)]
[(105, 'Ali', 25), (129, 'Rami', 22)]

In [30]:
# Students older than the average age
cur.execute("SELECT * FROM Student WHERE Age > (SELECT AVG(Age) FROM Student)")
print(cur.fetchall())

[(12, 'Muhammed', 22), (100, 'Yasin', 22), (101, 'Zayd', 27), (103, 'Amina', 22), (105, 'Ali', 25), (108, 'Omar', 24), (110, 'Bilal', 23), (112, 'Ibrahim', 26), (113, 'Sara', 22), (115, 'Musa', 28), (118, 'Hamza', 25), (120, 'Abdullah', 23), (121, 'Yasin', 22), (123, 'Huda', 24), (124, 'Tariq', 27), (127, 'Jamal', 26), (129, 'Rami', 22), (131, 'Samir', 23), (134, 'Kamil', 25), (136, 'Adil', 24), (137, 'Hana', 22), (140, 'Taha', 23), (141, 'Samiya', 26), (144, 'Zubair', 22), (147, 'Harun', 25), (149, 'Sulaiman', 24), (150, 'Nawal', 23), (151, 'Rehan', 23)]